name: "yolopx"
backend: "tensorrt"
max_batch_size: 0

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 1, 3, 384, 640 ]
  }
]

output [
  {
    name: "det_out"
    data_type: TYPE_FP32
    dims: [ 1, 5040, 6 ]
  },
  {
    name: "da_seg"
    data_type: TYPE_FP32
    dims: [ 1, 2, 384, 640 ]
  },
  {
    name: "ll_seg"
    data_type: TYPE_FP32
    dims: [ 1, 2, 384, 640 ]
  }
]
