name: "depth"
backend: "tensorrt"
max_batch_size: 0

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 1, 3, 518, 924 ]
  }
]

output [
  {
    name: "depth"
    data_type: TYPE_FP32
    dims: [ 1, 518, 924 ]
  }
]
